{
  "section_info": {
    "title": "Education_XX",
    "details": "_XXI am an enthusiastic, dedicated, and patient learner and researcher who aspires to explore and deepen my knowledge of Machine Learning and Deep Learning, particularly in their applied domains such as healthcare, automation, human–computer interaction, and the bio-sciences.",
    "icon_class": "bx bxs-graduation"
  },
  "summary": {
    "title": "Summary_XX",
    "status_list": [
      "_XXDoctor of Philosophy (PhD) Program",
      "Graduate Researcher, Higher Degree Research (HDR) at Deakin University",
      "Post-Graduate Research (PGR) Student at Coventry University",
      "Deakin–Coventry Cotutelle (Joint) Research Program.",
      "Application of AI, ML and DL in Health Informatics Research",
      "Institution-Industry Collaboration_XX"
    ]
  },
  "degrees": [
    {
      "degree_id": "phd_cu_csm",
      "column": "left",
      "degree_level": "Doctor of Philosophy (PhD)_XX",
      "degree_major": "_XXComputational Science and Mathematical Modelling (CSM)",
      "department_name": "_XXCentre for Computational Science and Mathematical Modelling (CSMM Centre)",
      "institution_name": "_XXCoventry University",
      "institution_location": "_XXCoventry, United Kingdom.",
      "institution_link": "https://www.coventry.ac.uk/",
      "timeframe_details": {
        "start_date": "_XXJan. 15, 2023",
        "end_date": "Present",
        "max_duration": "3.5-year program (maximum 4 years)",
        "award_date": "Ongoing"
      },
      "degree_type": "Full-time",
      "collaboration": [
        {
          "collaboration_type": "Cotutelle (joint)",
          "degree_major": "_XXInformation Technology (IT)",
          "department_name": "_XXSchool of Information Technology (SIT)",
          "institution_name": "Deakin University",
          "institution_location": "Melbourne, Australia.",
          "institution_link": "https://www.deakin.edu.au/"
        }
      ],
      "specialisation": "_XXApplied Machine Learning (ML) and Deep Learning (DL) in health informatics and (physiological) signal processing.",
      "scholarship": {
        "scholarship_name": "_XXCotutelle Studentship – awarded during the study period at Coventry University",
        "scholarship_organisation": "_XXCoventry University",
        "scholarship_organisation_location": "_XXCoventry, United Kingdom",
        "scholarship_link": "#honorsAwards"
      },
      "research_topic": "_XXA Machine Learning-based Analysis of Sleep Patterns in Healthy Ageing using Physiological Signals.",
      "activities_involvement": "Research · Development · Industry collaboration",
      "description_full": "_XXThis Cotutelle (joint) PhD program is jointly administered by Deakin University (host institution) and Coventry University (partner institution). All key milestones, including candidature confirmation, annual progress reviews, and final thesis defense, are conducted independently by both institutions. The project is guided by a strong supervisory team of more than four specialists (2 from each institutions) from Deakin University and Coventry University. This project is about finding relationship between sleep pattern and different health status (healthy or have sleep disorders) using a simpler physiological signal called Hypnogram for assistive diagnostic. Starting from traditional ML and ensemble ML to advanced models such as traditional DL, CNN, RNN, graph neural networks (GNN), are applied to analyse the feasibility of a wearable sleep monitoring system. The research is carried out under the Centre for Computational Science and Mathematical Modelling (CSM).",
      "thesis_details": {
        "thesis_title": "",
        "thesis_length": ""
      },
      "research_projects": [
        {
          "type": "_XXResearch",
          "title": "_XXA Machine Learning-based Analysis of Sleep Patterns in Healthy Ageing using Physiological Signals.",
          "link": "#projects"
        }
      ]
    },
    {
      "degree_id": "phd_du_it",
      "column": "left",
      "degree_level": "Doctor of Philosophy (PhD)_XX",
      "degree_major": "_XXInformation Technology (IT)",
      "department_name": "_XXSchool of Information Technology (SIT)",
      "institution_name": "_XXDeakin University",
      "institution_location": "_XXMelbourne, Australia",
      "institution_link": "https://www.deakin.edu.au/",
      "timeframe_details": {
        "start_date": "_XXJan. 15, 2023",
        "end_date": "Present",
        "max_duration": "3-year program (maximum 4 years)",
        "award_date": "Ongoing"
      },
      "degree_type": "Full-time",
      "collaboration": [
        {
          "collaboration_type": "Cotutelle (joint)",
          "degree_major": "_XXComputational Science and Mathematical Modelling (CSM)",
          "department_name": "_XXCentre for Computational Science and Mathematical Modelling (CSMM Centre)",
          "institution_name": "Coventry University",
          "institution_location": "Coventry, United Kingdom",
          "institution_link": "https://www.coventry.ac.uk/"
        }
      ],
      "specialisation": "_XXApplied Machine Learning (ML) and Deep Learning (DL) in health informatics and (physiological) signal processing.",
      "scholarship": {
        "scholarship_name": "_XXDeakin University Postgraduate Research Scholarship (DUPRS) – awarded for the duration of the study at Deakin University",
        "scholarship_organisation": "_XXDeakin University",
        "scholarship_organisation_location": "_XXMelbourne, Australia",
        "scholarship_link": "#honorsAwards"
      },
      "research_topic": "_XXA Machine Learning-based Analysis of Sleep Patterns in Healthy Ageing using Physiological Signals.",
      "activities_involvement": "_XXResearch · Development · Industry collaboration · Student engagement via: Australian Computer Society (ACS) · Deakin University Student Association (DUSA) · Deakin Biomed Society (DUBS) · Deakin Software Engineering Club (DSEC) · Deakin AI Society (DAIS)",
      "description_full": "_XXThis is a Cotutelle (joint) PhD program hosted by Deakin University (host institution), Australia, in collaboration with Coventry University (partner institution), United Kingdom. It is a full-time, research-based program spanning 3 years (maximum completion duration: 4 years), with a focus on, applied ML and DL with biomedical signal processing in detecting sleep disorders. All key milestones, including candidature confirmation, annual progress reviews, and final thesis defense, are conducted independently by both institutions. This project is about finding relationship between sleep pattern and different health status (healthy or have sleep disorders) using a simpler physiological signal called Hypnogram for assistive diagnostic. Starting from traditional ML and ensemble ML to advanced models such as traditional DL, CNN, RNN, graph neural networks (GNN), are applied to analyse the feasibility of a wearable sleep monitoring system. At Deakin, the program is conducted under the School of Information Technology (SIT), Faculty of Science, Engineering and Built Environment (SEBE), and the research is based at the Data Analytics and Research Lab (DARL).",
      "thesis_details": {
        "thesis_title": "",
        "thesis_length": ""
      },
      "research_projects": [
        {
          "type": "_XXResearch",
          "title": "A Machine Learning-based Analysis of Sleep Patterns in Healthy Ageing using Physiological Signals.",
          "link": "#projects"
        }
      ]
    },
    {
      "degree_id": "mres_du_it",
      "column": "right",
      "degree_level": "_XXMaster of Science (by Research) – MRes",
      "degree_major": "_XXInformation Technology (IT)",
      "department_name": "_XXSchool of Information Technology (SIT)",
      "institution_name": "_XXDeakin University",
      "institution_location": "_XXMelbourne, Australia",
      "institution_link": "https://www.deakin.edu.au/",
      "timeframe_details": {
        "start_date": "_XXFeb. 21, 2020",
        "end_date": "Feb. 20, 2022",
        "max_duration": "2-year program (maximum 3 years)",
        "award_date": "Oct. 06, 2022"
      },
      "degree_type": "Full-time",
      "collaboration": [],
      "specialisation": "_XXApplied Machine Learning (ML) and system optimisation with a focus on (pathological) signal processing and medical diagnostic",
      "scholarship": {
        "scholarship_name": "_XXScience and Technology Fellowship (STF)",
        "scholarship_organisation": "_XXDeakin University",
        "scholarship_organisation_location": "_XXMelbourne, Australia",
        "scholarship_link": "#honorsAwards"
      },
      "research_topic": "_XXMinimising Scalp Electroencephalogram (EEG) Channels for Epileptic Seizure Detection",
      "activities_involvement": "_XXResearch · Development · Industry collaboration · Student engagement through Deakin University Student Association (DUSA)",
      "description_full": "_XXThis full-time, research-intensive Master of Science (by Research) was conducted under the Data to Intelligence (D2I) Research Centre at Deakin University. My research focused on the intersection of biomedical engineering and Machine Learning (ML), specifically addressing the challenge of EEG channel reduction for seizure detection. By applying advanced signal processing and optimization techniques, the project aimed to improve the feasibility of long-term patient monitoring. The program involved significant technical development within the School of Information Technology (SIT) and required navigating complex biomedical datasets. The culmination of this research was a comprehensive thesis exceeding 50,000 words, successfully defended and awarded in late 2022.",
      "thesis_details": {
        "thesis_title": "_XXMinimising Electroencephalogram Channels for Epileptic Seizure Detection",
        "thesis_length": "_XXover 50,000 words."
      },
      "research_projects": [
        {"type": "Research", "title": "Channel Minimisation for Epileptic Seizure Detection and Prediction using Signal Processing and Machine Learning on Surface EEG Data.", "link": "#projects"},
        {"type": "Project", "title": "Epileptic Seizure Detection using Single-channel Deep Learning Models on Continuous EEG Recordings from ICU Patients (A collaborative work with Monash University and Alfred Health).", "link": "#projects"},
        {"type": "Project", "title": "Air Quality (Indoor Temperature) Prediction Based on Meteorological and Indoor Sensor Data (A MAAP Linkage ARC Project Funded by the Australian Research Council (ARC), and a Collaborative Work with Monash University and Sensor Industry AETMOS Australia).", "link": "#projects"}
      ]
    },
    {
      "degree_id": "bsc_hstu_cse",
      "column": "right",
      "degree_level": "_XXBachelor of Science (B.Sc.)",
      "degree_major": "_XXComputer Science and Engineering (CSE)",
      "department_name": "_XXDepartment of Computer Science and Engineering (CSE)",
      "institution_name": "_XXHajee Mohammad Danesh Science and Technology University (HSTU)",
      "institution_location": "_XXDinajpur, Bangladesh",
      "institution_link": "https://www.hstu.ac.bd/",
      "timeframe_details": {
        "start_date": "_XXJan. 05, 2007",
        "end_date": "Dec. 31, 2010",
        "max_duration": "4-year program",
        "award_date": "Feb. 19, 2012"
      },
      "degree_type": "Full-time",
      "collaboration": [],
      "specialisation": "_XXComputer programming and Algorithm, Database Management, Machine Learning and Pattern Recognition",
      "scholarship": null,
      "research_topic": "_XXAdvanced string search algorithms using indexed binary search for a J2ME-based English-to-English dictionary application.",
      "activities_involvement": "_XXAcademic coursework · Research · Software/Application development · Competitive programming · Active member of the programming community — Programmers Arena",
      "description_full": "_XXThis comprehensive four-year undergraduate program in Computer Science and Engineering provided a solid foundation in computational theory and engineering principles. The curriculum covered advanced subjects including microprocessor systems, system architecture, artificial intelligence, and pattern recognition. I was particularly active in the competitive programming circuit, being a member of the Programmers Arena. My final-year research involved developing highly efficient string search algorithms for mobile platforms using J2ME, which demonstrated my ability to apply complex algorithms to real-world software constraints. The degree culminated in a major research thesis and software project, essential for graduation from the Department of CSE.",
      "thesis_details": {
        "thesis_title": "_XXJ2ME English-to-English Dictionary with Indexed Binary Search",
        "thesis_length": "_XXapproximately 9,500 words"
      },
      "research_projects": [
        {
          "type": "_XXResearch",
          "title": "Development of a Dictionary Application using Java (J2ME) and Enhanced Text Searching Algorithms.",
          "link": "index.html#publications"
        }
      ]
    }
  ]
}